#!/bin/bash
##########################################################################################################
#Target Table : XXX.YYY
#Source Table : XXX.YYY
#Interface Name : XXX表
#Refresh Frequency : per day 每天处理
#Refresh Mode : 全量切片表，分区字段：dt,country_code
#修改人       修改时间     修改原因
#-------     -----------   -------------------
#XXXXX       2016-05-23   新建
##########################################################################################################

########################代码分隔线########################
echo "...非注释的内容"
:<<MULTILINECOMMENT
echo "...注释的内容"
echo "...注释的内容"
MULTILINECOMMENT
echo "...非注释的内容"
########################代码分隔线########################

# 其中，MULTILINECOMMENT可以随意命名，只要别跟中间的注释内容混淆即可。
# shell一旦遇到:<<MULTILINECOMMENT，就不执行脚本了，一直到再碰到MULTILINECOMMENT后重新开始执行脚本
# 如果忘记写MULTILINECOMMENT或者写错(由于已经不执行脚本了，所以即使写错也不会报错)，则:<<MULTILINECOMMENT之后的脚步将都不会执行。